// Алгоритмизация. Лабораторная работа №1.
// Ибрагимов Муса, ИВТ-б-о-22-1

#include <iostream>
using namespace std;

int main() {
    setlocale(LC_ALL, "ru");
    int array[10][10] = {
        {71, 81, 6,	50,	44,	16,	22,	10,	83,	1}
        {20, 39, 80, 95, 60, 59, 95, 76, 17, 27}
        {43, 7,	25,	70,	52,	36,	23,	47,	69,	35}
        {66, 44, 55, 77, 18, 13, 75, 66, 98, 94}
        {92, 44, 45, 54, 34, 45, 5, 16,	4, 40}
        {2,	68,	34,	50,	65,	49,	86,	75,	91,	28}
        {1,	28,	84,	18,	51,	23,	44,	79,	84,	36}
        {30, 71, 77, 73, 15, 52, 94, 28, 82, 39}
        {59, 52, 27, 25, 24, 56,3, 87, 84, 46}
        {67, 4,	79,	8,	39,	47,	31,	18,	65,	74}
    }
    for (int i = 8; i >= 0; i--) {
        array[i][0] += array[i + 1][0];
    }
    for (int j = 1; j < 10; j++)
    {
        array[9][j] += array[9][j - 1];
    }
    for (int j = 1; j < 10; j++) {
        array[9][j] += array[9][j - 1];
    }
    for (int i = 8; i >= 0; i--) {
        for (int j = 1; j < 10; j++) {
            int maxElement = max(array[i][j-1], array[i+1][j]);
            array[i][j] += maxElement;
        }
    }

}
